# ==============
# model settings
# ==============
# usage:
# train_N, test_N, e, c, H, O, epoch_size = ms[training_name]

#     train_N, test_N,   e, c, H, O,   epoch_size
ms = {'m00': (  40, 10,   50, 50, 50,2,    5),
      'm01': ( 900,100,  100,100,100,2,  100),
      'm02': (1900,100,  100,100,100,2,  100),
      'm03': ( 900,100,  200,200,200,2,  100),
      # 評価値でラベル分け。ポジネガ判定
      's01': ( 900,100,  100,100,100,2,  100),
      # 品詞とラベル設定を工夫
      'p01': ( 900,100,  100,100,100,2,   30),
      #
      'm11': ( 900,100,   50, 50, 50,2,   25),
      'm12': ( 900,100,   50, 50,100,2,   20)}

# vocab dic name
vn = {'m00': 'vocab_min',
      'm01': 'vocab_1k',
      'm02': 'vocab_2k',
      'm03': 'vocab_1k',
      's01': 'v_star_1k',
      'p01': 'v_p_1k',
      'm11': 'v_p_1k',
      'm12': 'v_p_1k'}

# X,Y data name
xy = {'m00': 'm00_XY',
      'm01': 'm01_XY',
      'm02': 'm02_XY',
      'm03': 'm01_XY',
      's01': 'xy_star_1k',
      'p01': 'xy_p_1k',
      'm11': 'xy_p_1k',
      'm12': 'xy_p_1k'}
